#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_compute_backend_service.db-backend will be updated in-place
  ~ resource "google_compute_backend_service" "db-backend" {
        affinity_cookie_ttl_sec         = 0
        connection_draining_timeout_sec = 300
        creation_timestamp              = "2020-02-20T04:26:52.030-08:00"
        enable_cdn                      = false
        fingerprint                     = "Xte3uouOWdE="
        health_checks                   = [
            "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/global/healthChecks/tcp-health-check",
        ]
        id                              = "projects/svg-devops-training-2/global/backendServices/dbbackend"
        load_balancing_scheme           = "EXTERNAL"
        name                            = "dbbackend"
        port_name                       = "http"
        project                         = "svg-devops-training-2"
      ~ protocol                        = "HTTP" -> "TCP"
        self_link                       = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/global/backendServices/dbbackend"
        session_affinity                = "NONE"
        timeout_sec                     = 30

        backend {
            balancing_mode               = "UTILIZATION"
            capacity_scaler              = 1
            group                        = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/zones/europe-north1-a/instanceGroups/databaseig"
            max_connections              = 0
            max_connections_per_endpoint = 0
            max_connections_per_instance = 0
            max_rate                     = 0
            max_rate_per_endpoint        = 0
            max_rate_per_instance        = 0
            max_utilization              = 0.8
        }
    }

  # google_compute_instance.backend_vms[0] must be replaced
-/+ resource "google_compute_instance" "backend_vms" {
        can_ip_forward          = false
      ~ cpu_platform            = "Intel Skylake" -> (known after apply)
        deletion_protection     = false
      - enable_display          = false -> null
      ~ guest_accelerator       = [] -> (known after apply)
      ~ id                      = "projects/svg-devops-training-2/zones/europe-north1-a/instances/backendvm0" -> (known after apply)
      ~ instance_id             = "6936371167295163867" -> (known after apply)
      ~ label_fingerprint       = "42WmSpB8rSM=" -> (known after apply)
      - labels                  = {} -> null
        machine_type            = "g1-small"
      - metadata                = {} -> null
      ~ metadata_fingerprint    = "K8O5oOr2GzQ=" -> (known after apply)
        metadata_startup_script = "sudo apt get -y update && sudo apt-get -y install nginx && sudo service nginx start"
      + min_cpu_platform        = (known after apply)
        name                    = "backendvm0"
      ~ project                 = "svg-devops-training-2" -> (known after apply)
      ~ self_link               = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/zones/europe-north1-a/instances/backendvm0" -> (known after apply)
        tags                    = [
            "backend",
        ]
      ~ tags_fingerprint        = "lw1rxEJIHXc=" -> (known after apply)
      ~ zone                    = "europe-north1-a" -> (known after apply)

      ~ boot_disk {
            auto_delete                = true
          ~ device_name                = "persistent-disk-0" -> (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
            mode                       = "READ_WRITE"
          ~ source                     = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/zones/europe-north1-a/disks/backendvm0" -> (known after apply)

          ~ initialize_params {
              ~ image  = "https://www.googleapis.com/compute/v1/projects/ubuntu-os-cloud/global/images/ubuntu-1804-bionic-v20200129a" -> "ubuntu-os-cloud/ubuntu-1804-lts"
              ~ labels = {} -> (known after apply)
              ~ size   = 10 -> (known after apply)
              ~ type   = "pd-standard" -> (known after apply)
            }
        }

      ~ network_interface {
          ~ name               = "nic0" -> (known after apply)
            network            = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/global/networks/my-name"
          ~ network_ip         = "10.0.0.9" -> (known after apply)
          ~ subnetwork         = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/regions/europe-north1/subnetworks/test-subnetwork" -> (known after apply) # forces replacement
          ~ subnetwork_project = "svg-devops-training-2" -> (known after apply)
        }

      ~ scheduling {
          ~ automatic_restart   = true -> (known after apply)
          ~ on_host_maintenance = "MIGRATE" -> (known after apply)
          ~ preemptible         = false -> (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }
    }

  # google_compute_instance.backend_vms[1] must be replaced
-/+ resource "google_compute_instance" "backend_vms" {
        can_ip_forward          = false
      ~ cpu_platform            = "Intel Skylake" -> (known after apply)
        deletion_protection     = false
      - enable_display          = false -> null
      ~ guest_accelerator       = [] -> (known after apply)
      ~ id                      = "projects/svg-devops-training-2/zones/europe-north1-a/instances/backendvm1" -> (known after apply)
      ~ instance_id             = "2879450857422966235" -> (known after apply)
      ~ label_fingerprint       = "42WmSpB8rSM=" -> (known after apply)
      - labels                  = {} -> null
        machine_type            = "g1-small"
      - metadata                = {} -> null
      ~ metadata_fingerprint    = "K8O5oOr2GzQ=" -> (known after apply)
        metadata_startup_script = "sudo apt get -y update && sudo apt-get -y install nginx && sudo service nginx start"
      + min_cpu_platform        = (known after apply)
        name                    = "backendvm1"
      ~ project                 = "svg-devops-training-2" -> (known after apply)
      ~ self_link               = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/zones/europe-north1-a/instances/backendvm1" -> (known after apply)
        tags                    = [
            "backend",
        ]
      ~ tags_fingerprint        = "lw1rxEJIHXc=" -> (known after apply)
      ~ zone                    = "europe-north1-a" -> (known after apply)

      ~ boot_disk {
            auto_delete                = true
          ~ device_name                = "persistent-disk-0" -> (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
            mode                       = "READ_WRITE"
          ~ source                     = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/zones/europe-north1-a/disks/backendvm1" -> (known after apply)

          ~ initialize_params {
              ~ image  = "https://www.googleapis.com/compute/v1/projects/ubuntu-os-cloud/global/images/ubuntu-1804-bionic-v20200129a" -> "ubuntu-os-cloud/ubuntu-1804-lts"
              ~ labels = {} -> (known after apply)
              ~ size   = 10 -> (known after apply)
              ~ type   = "pd-standard" -> (known after apply)
            }
        }

      ~ network_interface {
          ~ name               = "nic0" -> (known after apply)
            network            = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/global/networks/my-name"
          ~ network_ip         = "10.0.0.7" -> (known after apply)
          ~ subnetwork         = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/regions/europe-north1/subnetworks/test-subnetwork" -> (known after apply) # forces replacement
          ~ subnetwork_project = "svg-devops-training-2" -> (known after apply)
        }

      ~ scheduling {
          ~ automatic_restart   = true -> (known after apply)
          ~ on_host_maintenance = "MIGRATE" -> (known after apply)
          ~ preemptible         = false -> (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }
    }

  # google_compute_instance.backend_vms[2] must be replaced
-/+ resource "google_compute_instance" "backend_vms" {
        can_ip_forward          = false
      ~ cpu_platform            = "Intel Skylake" -> (known after apply)
        deletion_protection     = false
      - enable_display          = false -> null
      ~ guest_accelerator       = [] -> (known after apply)
      ~ id                      = "projects/svg-devops-training-2/zones/europe-north1-a/instances/backendvm2" -> (known after apply)
      ~ instance_id             = "6855018782992354779" -> (known after apply)
      ~ label_fingerprint       = "42WmSpB8rSM=" -> (known after apply)
      - labels                  = {} -> null
        machine_type            = "g1-small"
      - metadata                = {} -> null
      ~ metadata_fingerprint    = "K8O5oOr2GzQ=" -> (known after apply)
        metadata_startup_script = "sudo apt get -y update && sudo apt-get -y install nginx && sudo service nginx start"
      + min_cpu_platform        = (known after apply)
        name                    = "backendvm2"
      ~ project                 = "svg-devops-training-2" -> (known after apply)
      ~ self_link               = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/zones/europe-north1-a/instances/backendvm2" -> (known after apply)
        tags                    = [
            "backend",
        ]
      ~ tags_fingerprint        = "lw1rxEJIHXc=" -> (known after apply)
      ~ zone                    = "europe-north1-a" -> (known after apply)

      ~ boot_disk {
            auto_delete                = true
          ~ device_name                = "persistent-disk-0" -> (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
            mode                       = "READ_WRITE"
          ~ source                     = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/zones/europe-north1-a/disks/backendvm2" -> (known after apply)

          ~ initialize_params {
              ~ image  = "https://www.googleapis.com/compute/v1/projects/ubuntu-os-cloud/global/images/ubuntu-1804-bionic-v20200129a" -> "ubuntu-os-cloud/ubuntu-1804-lts"
              ~ labels = {} -> (known after apply)
              ~ size   = 10 -> (known after apply)
              ~ type   = "pd-standard" -> (known after apply)
            }
        }

      ~ network_interface {
          ~ name               = "nic0" -> (known after apply)
            network            = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/global/networks/my-name"
          ~ network_ip         = "10.0.0.8" -> (known after apply)
          ~ subnetwork         = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/regions/europe-north1/subnetworks/test-subnetwork" -> (known after apply) # forces replacement
          ~ subnetwork_project = "svg-devops-training-2" -> (known after apply)
        }

      ~ scheduling {
          ~ automatic_restart   = true -> (known after apply)
          ~ on_host_maintenance = "MIGRATE" -> (known after apply)
          ~ preemptible         = false -> (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }
    }

  # google_compute_instance.database_vms[0] must be replaced
-/+ resource "google_compute_instance" "database_vms" {
        can_ip_forward          = false
      ~ cpu_platform            = "Intel Skylake" -> (known after apply)
        deletion_protection     = false
      - enable_display          = false -> null
      ~ guest_accelerator       = [] -> (known after apply)
      ~ id                      = "projects/svg-devops-training-2/zones/europe-north1-a/instances/databasevm0" -> (known after apply)
      ~ instance_id             = "7653771580654472667" -> (known after apply)
      ~ label_fingerprint       = "42WmSpB8rSM=" -> (known after apply)
      - labels                  = {} -> null
        machine_type            = "g1-small"
      - metadata                = {} -> null
      ~ metadata_fingerprint    = "K8O5oOr2GzQ=" -> (known after apply)
        metadata_startup_script = "sudo apt get -y update && sudo apt-get -y install nginx && sudo service nginx start"
      + min_cpu_platform        = (known after apply)
        name                    = "databasevm0"
      ~ project                 = "svg-devops-training-2" -> (known after apply)
      ~ self_link               = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/zones/europe-north1-a/instances/databasevm0" -> (known after apply)
        tags                    = [
            "database",
        ]
      ~ tags_fingerprint        = "w2VJJusIj3s=" -> (known after apply)
      ~ zone                    = "europe-north1-a" -> (known after apply)

      ~ boot_disk {
            auto_delete                = true
          ~ device_name                = "persistent-disk-0" -> (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
            mode                       = "READ_WRITE"
          ~ source                     = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/zones/europe-north1-a/disks/databasevm0" -> (known after apply)

          ~ initialize_params {
              ~ image  = "https://www.googleapis.com/compute/v1/projects/ubuntu-os-cloud/global/images/ubuntu-1804-bionic-v20200129a" -> "ubuntu-os-cloud/ubuntu-1804-lts"
              ~ labels = {} -> (known after apply)
              ~ size   = 10 -> (known after apply)
              ~ type   = "pd-standard" -> (known after apply)
            }
        }

      ~ network_interface {
          ~ name               = "nic0" -> (known after apply)
            network            = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/global/networks/my-name"
          ~ network_ip         = "10.0.0.10" -> (known after apply)
          ~ subnetwork         = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/regions/europe-north1/subnetworks/test-subnetwork" -> (known after apply) # forces replacement
          ~ subnetwork_project = "svg-devops-training-2" -> (known after apply)
        }

      ~ scheduling {
          ~ automatic_restart   = true -> (known after apply)
          ~ on_host_maintenance = "MIGRATE" -> (known after apply)
          ~ preemptible         = false -> (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }
    }

  # google_compute_instance.database_vms[1] must be replaced
-/+ resource "google_compute_instance" "database_vms" {
        can_ip_forward          = false
      ~ cpu_platform            = "Intel Skylake" -> (known after apply)
        deletion_protection     = false
      - enable_display          = false -> null
      ~ guest_accelerator       = [] -> (known after apply)
      ~ id                      = "projects/svg-devops-training-2/zones/europe-north1-a/instances/databasevm1" -> (known after apply)
      ~ instance_id             = "8787467231096458715" -> (known after apply)
      ~ label_fingerprint       = "42WmSpB8rSM=" -> (known after apply)
      - labels                  = {} -> null
        machine_type            = "g1-small"
      - metadata                = {} -> null
      ~ metadata_fingerprint    = "K8O5oOr2GzQ=" -> (known after apply)
        metadata_startup_script = "sudo apt get -y update && sudo apt-get -y install nginx && sudo service nginx start"
      + min_cpu_platform        = (known after apply)
        name                    = "databasevm1"
      ~ project                 = "svg-devops-training-2" -> (known after apply)
      ~ self_link               = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/zones/europe-north1-a/instances/databasevm1" -> (known after apply)
        tags                    = [
            "database",
        ]
      ~ tags_fingerprint        = "w2VJJusIj3s=" -> (known after apply)
      ~ zone                    = "europe-north1-a" -> (known after apply)

      ~ boot_disk {
            auto_delete                = true
          ~ device_name                = "persistent-disk-0" -> (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
            mode                       = "READ_WRITE"
          ~ source                     = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/zones/europe-north1-a/disks/databasevm1" -> (known after apply)

          ~ initialize_params {
              ~ image  = "https://www.googleapis.com/compute/v1/projects/ubuntu-os-cloud/global/images/ubuntu-1804-bionic-v20200129a" -> "ubuntu-os-cloud/ubuntu-1804-lts"
              ~ labels = {} -> (known after apply)
              ~ size   = 10 -> (known after apply)
              ~ type   = "pd-standard" -> (known after apply)
            }
        }

      ~ network_interface {
          ~ name               = "nic0" -> (known after apply)
            network            = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/global/networks/my-name"
          ~ network_ip         = "10.0.0.11" -> (known after apply)
          ~ subnetwork         = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/regions/europe-north1/subnetworks/test-subnetwork" -> (known after apply) # forces replacement
          ~ subnetwork_project = "svg-devops-training-2" -> (known after apply)
        }

      ~ scheduling {
          ~ automatic_restart   = true -> (known after apply)
          ~ on_host_maintenance = "MIGRATE" -> (known after apply)
          ~ preemptible         = false -> (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }
    }

  # google_compute_instance.database_vms[2] must be replaced
-/+ resource "google_compute_instance" "database_vms" {
        can_ip_forward          = false
      ~ cpu_platform            = "Intel Skylake" -> (known after apply)
        deletion_protection     = false
      - enable_display          = false -> null
      ~ guest_accelerator       = [] -> (known after apply)
      ~ id                      = "projects/svg-devops-training-2/zones/europe-north1-a/instances/databasevm2" -> (known after apply)
      ~ instance_id             = "3732421136091434459" -> (known after apply)
      ~ label_fingerprint       = "42WmSpB8rSM=" -> (known after apply)
      - labels                  = {} -> null
        machine_type            = "g1-small"
      - metadata                = {} -> null
      ~ metadata_fingerprint    = "K8O5oOr2GzQ=" -> (known after apply)
        metadata_startup_script = "sudo apt get -y update && sudo apt-get -y install nginx && sudo service nginx start"
      + min_cpu_platform        = (known after apply)
        name                    = "databasevm2"
      ~ project                 = "svg-devops-training-2" -> (known after apply)
      ~ self_link               = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/zones/europe-north1-a/instances/databasevm2" -> (known after apply)
        tags                    = [
            "database",
        ]
      ~ tags_fingerprint        = "w2VJJusIj3s=" -> (known after apply)
      ~ zone                    = "europe-north1-a" -> (known after apply)

      ~ boot_disk {
            auto_delete                = true
          ~ device_name                = "persistent-disk-0" -> (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
            mode                       = "READ_WRITE"
          ~ source                     = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/zones/europe-north1-a/disks/databasevm2" -> (known after apply)

          ~ initialize_params {
              ~ image  = "https://www.googleapis.com/compute/v1/projects/ubuntu-os-cloud/global/images/ubuntu-1804-bionic-v20200129a" -> "ubuntu-os-cloud/ubuntu-1804-lts"
              ~ labels = {} -> (known after apply)
              ~ size   = 10 -> (known after apply)
              ~ type   = "pd-standard" -> (known after apply)
            }
        }

      ~ network_interface {
          ~ name               = "nic0" -> (known after apply)
            network            = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/global/networks/my-name"
          ~ network_ip         = "10.0.0.6" -> (known after apply)
          ~ subnetwork         = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/regions/europe-north1/subnetworks/test-subnetwork" -> (known after apply) # forces replacement
          ~ subnetwork_project = "svg-devops-training-2" -> (known after apply)
        }

      ~ scheduling {
          ~ automatic_restart   = true -> (known after apply)
          ~ on_host_maintenance = "MIGRATE" -> (known after apply)
          ~ preemptible         = false -> (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }
    }

  # google_compute_instance.vm_instance[0] must be replaced
-/+ resource "google_compute_instance" "vm_instance" {
        can_ip_forward          = false
      ~ cpu_platform            = "Intel Skylake" -> (known after apply)
        deletion_protection     = false
      - enable_display          = false -> null
      ~ guest_accelerator       = [] -> (known after apply)
      ~ id                      = "projects/svg-devops-training-2/zones/europe-north1-a/instances/frontendvm0" -> (known after apply)
      ~ instance_id             = "9045996731575289299" -> (known after apply)
      ~ label_fingerprint       = "42WmSpB8rSM=" -> (known after apply)
      - labels                  = {} -> null
        machine_type            = "g1-small"
      - metadata                = {} -> null
      ~ metadata_fingerprint    = "6gzkphTOcHQ=" -> (known after apply)
        metadata_startup_script = "sudo apt get -y update"
      + min_cpu_platform        = (known after apply)
        name                    = "frontendvm0"
      ~ project                 = "svg-devops-training-2" -> (known after apply)
      ~ self_link               = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/zones/europe-north1-a/instances/frontendvm0" -> (known after apply)
        tags                    = [
            "frontend",
        ]
      ~ tags_fingerprint        = "4s55Dl-6pHw=" -> (known after apply)
      ~ zone                    = "europe-north1-a" -> (known after apply)

      ~ boot_disk {
            auto_delete                = true
          ~ device_name                = "persistent-disk-0" -> (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
            mode                       = "READ_WRITE"
          ~ source                     = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/zones/europe-north1-a/disks/frontendvm0" -> (known after apply)

          ~ initialize_params {
              ~ image  = "https://www.googleapis.com/compute/v1/projects/ubuntu-os-cloud/global/images/ubuntu-1804-bionic-v20200129a" -> "ubuntu-os-cloud/ubuntu-1804-lts"
              ~ labels = {} -> (known after apply)
              ~ size   = 10 -> (known after apply)
              ~ type   = "pd-standard" -> (known after apply)
            }
        }

      ~ network_interface {
          ~ name               = "nic0" -> (known after apply)
            network            = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/global/networks/my-name"
          ~ network_ip         = "10.0.0.17" -> (known after apply)
          ~ subnetwork         = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/regions/europe-north1/subnetworks/test-subnetwork" -> (known after apply) # forces replacement
          ~ subnetwork_project = "svg-devops-training-2" -> (known after apply)
        }

      ~ scheduling {
          ~ automatic_restart   = true -> (known after apply)
          ~ on_host_maintenance = "MIGRATE" -> (known after apply)
          ~ preemptible         = false -> (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }
    }

  # google_compute_instance.vm_instance[1] must be replaced
-/+ resource "google_compute_instance" "vm_instance" {
        can_ip_forward          = false
      ~ cpu_platform            = "Intel Skylake" -> (known after apply)
        deletion_protection     = false
      - enable_display          = false -> null
      ~ guest_accelerator       = [] -> (known after apply)
      ~ id                      = "projects/svg-devops-training-2/zones/europe-north1-a/instances/frontendvm1" -> (known after apply)
      ~ instance_id             = "2782393426986124765" -> (known after apply)
      ~ label_fingerprint       = "42WmSpB8rSM=" -> (known after apply)
      - labels                  = {} -> null
        machine_type            = "g1-small"
      - metadata                = {} -> null
      ~ metadata_fingerprint    = "6gzkphTOcHQ=" -> (known after apply)
        metadata_startup_script = "sudo apt get -y update"
      + min_cpu_platform        = (known after apply)
        name                    = "frontendvm1"
      ~ project                 = "svg-devops-training-2" -> (known after apply)
      ~ self_link               = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/zones/europe-north1-a/instances/frontendvm1" -> (known after apply)
        tags                    = [
            "frontend",
        ]
      ~ tags_fingerprint        = "4s55Dl-6pHw=" -> (known after apply)
      ~ zone                    = "europe-north1-a" -> (known after apply)

      ~ boot_disk {
            auto_delete                = true
          ~ device_name                = "persistent-disk-0" -> (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
            mode                       = "READ_WRITE"
          ~ source                     = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/zones/europe-north1-a/disks/frontendvm1" -> (known after apply)

          ~ initialize_params {
              ~ image  = "https://www.googleapis.com/compute/v1/projects/ubuntu-os-cloud/global/images/ubuntu-1804-bionic-v20200129a" -> "ubuntu-os-cloud/ubuntu-1804-lts"
              ~ labels = {} -> (known after apply)
              ~ size   = 10 -> (known after apply)
              ~ type   = "pd-standard" -> (known after apply)
            }
        }

      ~ network_interface {
          ~ name               = "nic0" -> (known after apply)
            network            = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/global/networks/my-name"
          ~ network_ip         = "10.0.0.16" -> (known after apply)
          ~ subnetwork         = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/regions/europe-north1/subnetworks/test-subnetwork" -> (known after apply) # forces replacement
          ~ subnetwork_project = "svg-devops-training-2" -> (known after apply)
        }

      ~ scheduling {
          ~ automatic_restart   = true -> (known after apply)
          ~ on_host_maintenance = "MIGRATE" -> (known after apply)
          ~ preemptible         = false -> (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }
    }

  # google_compute_instance.vm_instance[2] must be replaced
-/+ resource "google_compute_instance" "vm_instance" {
        can_ip_forward          = false
      ~ cpu_platform            = "Intel Skylake" -> (known after apply)
        deletion_protection     = false
      - enable_display          = false -> null
      ~ guest_accelerator       = [] -> (known after apply)
      ~ id                      = "projects/svg-devops-training-2/zones/europe-north1-a/instances/frontendvm2" -> (known after apply)
      ~ instance_id             = "8015322808100046301" -> (known after apply)
      ~ label_fingerprint       = "42WmSpB8rSM=" -> (known after apply)
      - labels                  = {} -> null
        machine_type            = "g1-small"
      - metadata                = {} -> null
      ~ metadata_fingerprint    = "6gzkphTOcHQ=" -> (known after apply)
        metadata_startup_script = "sudo apt get -y update"
      + min_cpu_platform        = (known after apply)
        name                    = "frontendvm2"
      ~ project                 = "svg-devops-training-2" -> (known after apply)
      ~ self_link               = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/zones/europe-north1-a/instances/frontendvm2" -> (known after apply)
        tags                    = [
            "frontend",
        ]
      ~ tags_fingerprint        = "4s55Dl-6pHw=" -> (known after apply)
      ~ zone                    = "europe-north1-a" -> (known after apply)

      ~ boot_disk {
            auto_delete                = true
          ~ device_name                = "persistent-disk-0" -> (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
            mode                       = "READ_WRITE"
          ~ source                     = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/zones/europe-north1-a/disks/frontendvm2" -> (known after apply)

          ~ initialize_params {
              ~ image  = "https://www.googleapis.com/compute/v1/projects/ubuntu-os-cloud/global/images/ubuntu-1804-bionic-v20200129a" -> "ubuntu-os-cloud/ubuntu-1804-lts"
              ~ labels = {} -> (known after apply)
              ~ size   = 10 -> (known after apply)
              ~ type   = "pd-standard" -> (known after apply)
            }
        }

      ~ network_interface {
          ~ name               = "nic0" -> (known after apply)
            network            = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/global/networks/my-name"
          ~ network_ip         = "10.0.0.15" -> (known after apply)
          ~ subnetwork         = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/regions/europe-north1/subnetworks/test-subnetwork" -> (known after apply) # forces replacement
          ~ subnetwork_project = "svg-devops-training-2" -> (known after apply)
        }

      ~ scheduling {
          ~ automatic_restart   = true -> (known after apply)
          ~ on_host_maintenance = "MIGRATE" -> (known after apply)
          ~ preemptible         = false -> (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }
    }

  # google_compute_instance_group.backendig will be updated in-place
  ~ resource "google_compute_instance_group" "backendig" {
        description = "backendig"
        id          = "projects/svg-devops-training-2/zones/europe-north1-a/instanceGroups/backendig"
      ~ instances   = [
          - "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/zones/europe-north1-a/instances/backendvm0",
          - "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/zones/europe-north1-a/instances/backendvm1",
          - "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/zones/europe-north1-a/instances/backendvm2",
        ] -> (known after apply)
        name        = "backendig"
        network     = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/global/networks/my-name"
        project     = "svg-devops-training-2"
        self_link   = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/zones/europe-north1-a/instanceGroups/backendig"
        size        = 3
        zone        = "europe-north1-a"

        named_port {
            name = "http"
            port = 8080
        }
        named_port {
            name = "https"
            port = 8443
        }
    }

  # google_compute_instance_group.databaseig will be updated in-place
  ~ resource "google_compute_instance_group" "databaseig" {
        description = "databaseig"
        id          = "projects/svg-devops-training-2/zones/europe-north1-a/instanceGroups/databaseig"
      ~ instances   = [
          - "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/zones/europe-north1-a/instances/databasevm0",
          - "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/zones/europe-north1-a/instances/databasevm1",
          - "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/zones/europe-north1-a/instances/databasevm2",
        ] -> (known after apply)
        name        = "databaseig"
        network     = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/global/networks/my-name"
        project     = "svg-devops-training-2"
        self_link   = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/zones/europe-north1-a/instanceGroups/databaseig"
        size        = 3
        zone        = "europe-north1-a"

        named_port {
            name = "http"
            port = 8080
        }
        named_port {
            name = "https"
            port = 8443
        }
    }

  # google_compute_instance_group.frontendig will be updated in-place
  ~ resource "google_compute_instance_group" "frontendig" {
        description = "frontendig"
        id          = "projects/svg-devops-training-2/zones/europe-north1-a/instanceGroups/frontendig"
      ~ instances   = [] -> (known after apply)
        name        = "frontendig"
        network     = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/global/networks/my-name"
        project     = "svg-devops-training-2"
        self_link   = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/zones/europe-north1-a/instanceGroups/frontendig"
        size        = 0
        zone        = "europe-north1-a"

        named_port {
            name = "http"
            port = 8080
        }
        named_port {
            name = "https"
            port = 8443
        }
    }

  # google_compute_subnetwork.backend-network will be created
  + resource "google_compute_subnetwork" "backend-network" {
      + creation_timestamp = (known after apply)
      + enable_flow_logs   = (known after apply)
      + fingerprint        = (known after apply)
      + gateway_address    = (known after apply)
      + id                 = (known after apply)
      + ip_cidr_range      = "10.0.20.0/24"
      + name               = "backend-subnetwork"
      + network            = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/global/networks/my-name"
      + project            = (known after apply)
      + region             = "europe-north1"
      + secondary_ip_range = (known after apply)
      + self_link          = (known after apply)
    }

  # google_compute_subnetwork.db-network will be created
  + resource "google_compute_subnetwork" "db-network" {
      + creation_timestamp = (known after apply)
      + enable_flow_logs   = (known after apply)
      + fingerprint        = (known after apply)
      + gateway_address    = (known after apply)
      + id                 = (known after apply)
      + ip_cidr_range      = "10.0.30.0/24"
      + name               = "db-subnetwork"
      + network            = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/global/networks/my-name"
      + project            = (known after apply)
      + region             = "europe-north1"
      + secondary_ip_range = (known after apply)
      + self_link          = (known after apply)
    }

  # google_compute_subnetwork.frontend-network will be created
  + resource "google_compute_subnetwork" "frontend-network" {
      + creation_timestamp = (known after apply)
      + enable_flow_logs   = (known after apply)
      + fingerprint        = (known after apply)
      + gateway_address    = (known after apply)
      + id                 = (known after apply)
      + ip_cidr_range      = "10.0.10.0/24"
      + name               = "frontend-subnetwork"
      + network            = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/global/networks/my-name"
      + project            = (known after apply)
      + region             = "europe-north1"
      + secondary_ip_range = (known after apply)
      + self_link          = (known after apply)
    }

  # google_compute_subnetwork.network-with-private-secondary-ip-ranges will be destroyed
  - resource "google_compute_subnetwork" "network-with-private-secondary-ip-ranges" {
      - creation_timestamp       = "2020-02-18T01:27:59.035-08:00" -> null
      - gateway_address          = "10.0.0.1" -> null
      - id                       = "projects/svg-devops-training-2/regions/europe-north1/subnetworks/test-subnetwork" -> null
      - ip_cidr_range            = "10.0.0.0/24" -> null
      - name                     = "test-subnetwork" -> null
      - network                  = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/global/networks/my-name" -> null
      - private_ip_google_access = false -> null
      - project                  = "svg-devops-training-2" -> null
      - region                   = "europe-north1" -> null
      - secondary_ip_range       = [] -> null
      - self_link                = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/regions/europe-north1/subnetworks/test-subnetwork" -> null
    }

Plan: 12 to add, 4 to change, 10 to destroy.
```

</details>

*Workflow: `Terraform GitHub Actions`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`*
